# Getting and Knowing your Data



### Step 1. Import the necessary libraries

In [2]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user) and assign it to a variable called users and use the 'user_id' as index

In [40]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

data_ejercicio = pd.read_csv(url, sep= '|', index_col= 'user_id')

### Step 3. See the first 25 entries

In [7]:
print(data_ejercicio.iloc[:25])

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 4. See the first 25 entries in a different way

In [11]:
data_ejercicio.head(20)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660

### Step 5. See the last 10 entries

In [20]:
data_ejercicio.iloc[-11:]

         age gender     occupation zip_code
user_id
933       28      M        student    48105
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [16]:
data_ejercicio.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?
Solve it by 2 different ways

In [21]:
data_ejercicio.shape

(943, 4)

In [22]:
data_ejercicio.size

3772

In [27]:
data_ejercicio.sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of          age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]>

In [25]:
data_ejercicio.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### Step 7. What is the number of columns in the dataset?
Solve it by 2 different ways

In [30]:
data_ejercicio.shape[1]

4

In [29]:
data_ejercicio.sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of          age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]>

### Step 8. Print the name of all the columns.

In [32]:
print(data_ejercicio.columns)

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. How is the dataset indexed? Get the index values

In [41]:
print(data_ejercicio.index)

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

### Step 10. What is the data type of each column?
Solve it by 2 different ways

In [195]:
data_ejercicio.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [196]:
data_ejercicio.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 69.1+ KB

### Step 11. Print only the occupation column
Solve it by 2 different ways

In [197]:
data_ejercicio['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [203]:
data_ejercicio.iloc[::, 2]

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [204]:
data_ejercicio.loc[::, 'occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [202]:
data_ejercicio.columns.get_loc('occupation')

2

### Step 12. How many different occupations are in this dataset? How many users per occupation are in the dataset?

In [207]:
#unique
len(data_ejercicio['occupation'].unique())

21

In [209]:
#nunique
data_ejercicio['occupation'].nunique()

21

In [249]:
#value_counts con atributo normalize para porcentajes
data_ejercicio['occupation'].value_counts(normalize= True)*100

student          20.784730
other            11.134677
educator         10.074231
administrator     8.377519
engineer          7.104984
programmer        6.998940
librarian         5.408271
writer            4.772004
executive         3.393425
scientist         3.287381
artist            2.969247
technician        2.863203
marketing         2.757158
entertainment     1.908802
healthcare        1.696713
retired           1.484624
lawyer            1.272534
salesman          1.272534
none              0.954401
homemaker         0.742312
doctor            0.742312
Name: occupation, dtype: float64

In [246]:
#porcentaje de 'engineers'
data_ejercicio['occupation'].value_counts().engineer/len(data_ejercicio)*100

7.104984093319194

In [214]:
#drop_duplicates
new_data_woduplicates = data_ejercicio.drop_duplicates(['occupation'])
len(new_data_woduplicates)

21

### Step 13. What is the most frequent occupation?

In [227]:
data_ejercicio['occupation'].value_counts().index[0]

'student'

### Step 14. Summarize the DataFrame.

In [250]:
data_ejercicio.sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of          age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]>

In [252]:
data_ejercicio.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 69.1+ KB

In [253]:
data_ejercicio.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### Step 15. Summarize all the columns

In [254]:
data_ejercicio.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### Step 16. Summarize only the occupation column

In [256]:
data_ejercicio['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [259]:
data_ejercicio['occupation'].sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object>

### Step 17. What is the mean age of users?

In [261]:
np.mean(data_ejercicio['age'])

34.05196182396607

In [277]:
#data solo de estudiantes
students_data = data_ejercicio[data_ejercicio['occupation'] == 'student']
students_data.describe(include='all')

               age gender occupation zip_code
count   196.000000    196        196      196
unique         NaN      2          1      179
top            NaN      M    student    55414
freq           NaN    136        196        6
mean     22.081633    NaN        NaN      NaN
std       5.284081    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      19.000000    NaN        NaN      NaN
50%      21.000000    NaN        NaN      NaN
75%      25.000000    NaN        NaN      NaN
max      42.000000    NaN        NaN      NaN

In [303]:
data_ejercicio['occupation'] == 'student'

user_id
1      False
2      False
3      False
4      False
5      False
       ...
939     True
940    False
941     True
942    False
943     True
Name: occupation, Length: 943, dtype: bool

### Step 18. What is the age with least occurrence?

In [282]:
data_ejercicio['age'].value_counts().tail(5)

7     1
66    1
11    1
10    1
73    1
Name: age, dtype: int64

In [321]:
#revisar (Version no funciona)
#data_ejercicio.loc[data_ejercicio['age'].value_counts() == 1]

7     1
66    1
11    1
10    1
73    1
Name: age, dtype: int64

In [335]:
data_ejercicio['age'].value_counts()[data_ejercicio['age'].value_counts() == data_ejercicio['age'].value_counts().min()]

7     1
66    1
11    1
10    1
73    1
Name: age, dtype: int64

In [330]:
data_ejercicio['age'].value_counts().min()

1

In [311]:
#Version funcionando
data_ejercicio["age"].value_counts()[data_ejercicio["age"].value_counts()== min(data_ejercicio["age"].value_counts())]

7     1
66    1
11    1
10    1
73    1
Name: age, dtype: int64

In [322]:
#Version funcionando
data_ejercicio["age"].value_counts()[data_ejercicio["age"].value_counts()== min(data_ejercicio["age"].value_counts())]

7     1
66    1
11    1
10    1
73    1
Name: age, dtype: int64

In [316]:
min(data_ejercicio["age"].value_counts())

1

In [323]:
#Version para todo el dataframe (No solo la serie 'age')
mask= data_ejercicio['age'].value_counts() == 1

data_ejercicio[data_ejercicio['age'].isin(mask.index[mask])]

         age gender occupation zip_code
user_id
30         7      M    student    55436
211       66      M   salesman    32605
289       11      M       none    94619
471       10      M    student    77459
481       73      M    retired    37771